"""
This module currently is not in use. But it's preserved in the app as a reminder, that great things can start
with small intentions. This bot was initially created to generate a horoscope, as a very first and only service
added in the app. But it gave inspiration to improve it and extend it later with additional functionality.

Horoscope service is currently maintained by OpenAI module, that is able to generate it in no less whacky way.
"""
import random

TEMPLATE: str = "{} {} {} {}"


def get_horoscope() -> str:
    """Send a text with a horoscope"""
    first = [
        "\nСегодня — идеальный день для новых начинаний.",
        "\nОптимальный день для того, чтобы решиться на смелый поступок!",
        "\nБудьте осторожны, сегодня звёзды могут повлиять на ваше финансовое состояние.",
        "\nЛучшее время для того, чтобы начать новые отношения или разобраться со старыми.",
        "\nПлодотворный день для того, чтобы разобраться с накопившимися делами.",
    ]
    second = [
        "Но помните, что даже в этом случае нужно не забывать про",
        "Если поедете за город, заранее подумайте про",
        "Те, кто сегодня нацелен выполнить множество дел, должны помнить про",
        "Если у вас упадок сил, обратите внимание на",
        "Помните, что мысли материальны, а значит вам в течение дня нужно постоянно думать про",
    ]
    second_add = [
        "отношения с друзьями и близкими.",
        "работу и деловые вопросы, которые могут так некстати помешать планам.",
        "себя и своё здоровье, иначе к вечеру возможен полный раздрай.",
        "бытовые вопросы — особенно те, которые вы не доделали вчера.",
        "отдых, чтобы не превратить себя в загнанную лошадь в конце месяца.",
    ]
    third = [
        "Злые языки могут говорить вам обратное, но сегодня их слушать не нужно.",
        "Знайте, что успех благоволит только настойчивым, поэтому посвятите этот день воспитанию духа.",
        "Даже если вы не сможете уменьшить влияние ретроградного Меркурия, то хотя бы доведите дела до конца.",
        "Не нужно бояться одиноких встреч — сегодня то самое время, когда они значат многое.",
        "Если встретите незнакомца на пути — проявите участие, и тогда эта встреча посулит вам приятные хлопоты.",
    ]

    return TEMPLATE.format(
        random.choice(first),
        random.choice(second),
        random.choice(second_add),
        random.choice(third),
    )
